#Занятие 1. Ввод и вывод данных
#Задача «Площадь прямоугольного треугольника»
#Условие:
#Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь. 
#Каждое число записано в отдельной строке.

b = int(input('input b: '))
h = int(input('input h: '))
a = 0.5 * b * h 

print(a)
